In [35]:
from sklearn.preprocessing import LabelEncoder, OneHotEncoder
import pandas as pd
import numpy as np

In [12]:
# 레이블 인코딩
item = ['TV', '냉장고', '전자레인지', '믹서', '냉장고', '선풍기', 'TV']
encoder = LabelEncoder()
encoder.fit(item)
labels = encoder.transform(item)
print(labels)

[0 1 4 2 1 3 0]

In [13]:
print(encoder.classes_)

['TV' '냉장고' '믹서' '선풍기' '전자레인지']

In [14]:
print(encoder.inverse_transform([0,1,2,3,4,4,4]))

['TV' '냉장고' '믹서' '선풍기' '전자레인지' '전자레인지' '전자레인지']

In [15]:
# Dummy 변환
df = pd.DataFrame({'item': item}) 
print(df) 
print(pd.get_dummies(df))

    item
0     TV
1    냉장고
2  전자레인지
3     믹서
4    냉장고
5    선풍기
6     TV
   item_TV  item_냉장고  item_믹서  item_선풍기  item_전자레인지
0        1         0        0         0           0
1        0         1        0         0           0
2        0         0        0         0           1
3        0         0        1         0           0
4        0         1        0         0           0
5        0         0        0         1           0
6        1         0        0         0           0

In [95]:
data = pd.read_csv('datasets/train.csv')
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [104]:
Sex1 = data['Sex']
Sex1.unique()

array(['male', 'female'], dtype=object)

In [101]:
ohe = OneHotEncoder(sparse=False)
ohe

OneHotEncoder(sparse=False)

In [105]:
Sex1.shape

(891,)

In [108]:
# 벡터를 입력하면 안되므로 reshape을 이용해 형태를 바꿔준다
Sex1.values.reshape(-1,1).shape

(891, 1)

In [109]:
ohe.fit(Sex1.values.reshape(-1,1))

OneHotEncoder(sparse=False)

In [110]:
one_hot_encoded = ohe.transform(Sex1.values.reshape(-1,1))
one_hot_encoded

array([[0., 1.],
       [1., 0.],
       [1., 0.],
       ...,
       [1., 0.],
       [0., 1.],
       [0., 1.]])

In [112]:
print(type(ohe.categories_))
ohe.categories_

<class 'list'>

[array(['female', 'male'], dtype=object)]

In [113]:
# 인덱싱으로 리스트를 풀어낸다.
ohe.categories_[0]

array(['female', 'male'], dtype=object)

In [116]:
ohe_df=pd.DataFrame(one_hot_encoded, columns=ohe.categories_)
ohe_df.head()

  female male
0    0.0  1.0
1    1.0  0.0
2    1.0  0.0
3    1.0  0.0
4    0.0  1.0

In [123]:
# 데이터프레임 합치기
pd.concat([data,ohe_df],axis=1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Sex2,"(female,)","(male,)"
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1,0.0,1.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,1.0,0.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,1.0,0.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0,1.0,0.0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1,0.0,1.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,1,0.0,1.0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,0,1.0,0.0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,0,1.0,0.0
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,1,0.0,1.0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,1,0.0,1.0

In [124]:
def change(x):
    if x=='male':
        return 1
    else :
        return 0
data['Sex2'] = data.Sex.apply(change)

In [125]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Sex2
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1